nxp-mcuxpresso/mcuxsdk-examples/_boards/k32w148evk/common/pin_mux/pin_mux.c
    const port_pin_config_t LED_RED = {/* Internal pull-up/down resistor is disabled */
                                       (uint16_t)kPORT_PullDisable,
                                       /* Low internal pull resistor value is selected. */
                                       (uint16_t)kPORT_LowPullResistor,
                                       /* Fast slew rate is configured */
                                       (uint16_t)kPORT_FastSlewRate,
                                       /* Passive input filter is disabled */
                                       (uint16_t)kPORT_PassiveFilterDisable,
                                       /* Open drain output is disabled */
                                       (uint16_t)kPORT_OpenDrainDisable,
                                       /* Low drive strength is configured */
                                       (uint16_t)kPORT_LowDriveStrength,
                                       /* Normal drive strength is configured */
                                       (uint16_t)kPORT_NormalDriveStrength,
                                       /* Pin is configured as PTA21 */
                                       (uint16_t)kPORT_MuxAsGpio,
                                       /* Pin Control Register fields [15:0] are not locked */
                                       (uint16_t)kPORT_UnlockRegister};
    /* PORTA21 (pin 18) is configured as PTA21 */
    PORT_SetPinConfig(BOARD_INITLEDSPINS_LED_RED_PORT, BOARD_INITLEDSPINS_LED_RED_PIN, &LED_RED);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitDEBUG_UARTPins:
- options: {callFromInitBoot: 'true', coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: '39', peripheral: LPUART1, signal: RX, pin_signal: PTC2/WUU0_P9/LPSPI1_SOUT/LPUART1_RX/LPI2C1_SCLS/TPM1_CH2/I3C0_PUR/FLEXIO0_D18, pull_select: down,
    pull_enable: disable, slew_rate: fast, open_drain: disable, drive_strength: low}
  - {pin_num: '40', peripheral: LPUART1, signal: TX, pin_signal: PTC3/LPSPI1_SCK/LPUART1_TX/LPI2C1_SDAS/TPM1_CH3/FLEXIO0_D19, pull_select: down, pull_enable: disable,
    slew_rate: fast, open_drain: disable, drive_strength: low}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitDEBUG_UARTPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitDEBUG_UARTPins(void)
{
    /* Clock Configuration: Peripheral clocks are enabled; module does not stall low power mode entry */
    CLOCK_EnableClock(kCLOCK_PortC);

    const port_pin_config_t DEBUG_UART_RX = {/* Internal pull-up/down resistor is disabled */
                                             (uint16_t)kPORT_PullDisable,
                                             /* Low internal pull resistor value is selected. */
                                             (uint16_t)kPORT_LowPullResistor,
                                             /* Fast slew rate is configured */
                                             (uint16_t)kPORT_FastSlewRate,
                                             /* Passive input filter is disabled */
                                             (uint16_t)kPORT_PassiveFilterDisable,
                                             /* Open drain output is disabled */
                                             (uint16_t)kPORT_OpenDrainDisable,
                                             /* Low drive strength is configured */
                                             (uint16_t)kPORT_LowDriveStrength,
                                             /* Normal drive strength is configured */
                                             (uint16_t)kPORT_NormalDriveStrength,
                                             /* Pin is configured as LPUART1_RX */
                                             (uint16_t)kPORT_MuxAlt3,
                                             /* Pin Control Register fields [15:0] are not locked */
                                             (uint16_t)kPORT_UnlockRegister};
    /* PORTC2 (pin 39) is configured as LPUART1_RX */
    PORT_SetPinConfig(BOARD_INITDEBUG_UARTPINS_DEBUG_UART_RX_PORT, BOARD_INITDEBUG_UARTPINS_DEBUG_UART_RX_PIN, &DEBUG_UART_RX);

    const port_pin_config_t DEBUG_UART_TX = {/* Internal pull-up/down resistor is disabled */
                                             (uint16_t)kPORT_PullDisable,
                                             /* Low internal pull resistor value is selected. */
                                             (uint16_t)kPORT_LowPullResistor,
                                             /* Fast slew rate is configured */
                                             (uint16_t)kPORT_FastSlewRate,
                                             /* Passive input filter is disabled */
                                             (uint16_t)kPORT_PassiveFilterDisable,
                                             /* Open drain output is disabled */
                                             (uint16_t)kPORT_OpenDrainDisable,
                                             /* Low drive strength is configured */
                                             (uint16_t)kPORT_LowDriveStrength,
                                             /* Normal drive strength is configured */
                                             (uint16_t)kPORT_NormalDriveStrength,
                                             /* Pin is configured as LPUART1_TX */
                                             (uint16_t)kPORT_MuxAlt3,
                                             /* Pin Control Register fields [15:0] are not locked */
                                             (uint16_t)kPORT_UnlockRegister};
    /* PORTC3 (pin 40) is configured as LPUART1_TX */
    PORT_SetPinConfig(BOARD_INITDEBUG_UARTPINS_DEBUG_UART_TX_PORT, BOARD_INITDEBUG_UARTPINS_DEBUG_UART_TX_PIN, &DEBUG_UART_TX);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitBUTTONsPins:
- options: {callFromInitBoot: 'false', coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: '24', peripheral: GPIOD, signal: 'GPIO, 1', pin_signal: ADC0_B5/PTD1/SPC0_LPREQ/NMI_b/RF_GPO_4, direction: INPUT, pull_select: up, pull_enable: enable,
    pull_value: low, passive_filter: disable, open_drain: disable}
  - {pin_num: '44', peripheral: GPIOC, signal: 'GPIO, 6', pin_signal: ADC0_A8/PTC6/WUU0_P11/LPSPI1_PCS1/TPM1_CH5/FLEXIO0_D22, direction: INPUT, pull_select: up, pull_enable: enable,
    slew_rate: fast, open_drain: disable, drive_strength: low}
  - {pin_num: '10', peripheral: GPIOA, signal: 'GPIO, 4', pin_signal: ADC0_A10/CMP0_IN0/PTA4/WUU0_P2/RF_XTAL_OUT_ENABLE/RF_GPO_9/TPM0_CLKIN/TRACE_SWO/FLEXIO0_D4/BOOT_CONFIG,
    direction: INPUT, pull_select: up, pull_enable: enable, slew_rate: fast, open_drain: disable, drive_strength: low}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

