nxp-mcuxpresso/mcuxsdk-examples/_boards/k32w148evk/common/pin_mux/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitFLASHPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitFLASHPins(void)
{
    /* Clock Configuration: Peripheral clocks are enabled; module does not stall low power mode entry */
    CLOCK_EnableClock(kCLOCK_GpioB);
    /* Clock Configuration: Peripheral clocks are enabled; module does not stall low power mode entry */
    CLOCK_EnableClock(kCLOCK_PortB);

    gpio_pin_config_t FLASH_RST_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PTB4 (pin 2)  */
    GPIO_PinInit(BOARD_INITFLASHPINS_FLASH_RST_GPIO, BOARD_INITFLASHPINS_FLASH_RST_PIN, &FLASH_RST_config);

    const port_pin_config_t FLASH_CS = {/* Internal pull-up/down resistor is disabled */
                                        (uint16_t)kPORT_PullDisable,
                                        /* Low internal pull resistor value is selected. */
                                        (uint16_t)kPORT_LowPullResistor,
                                        /* Fast slew rate is configured */
                                        (uint16_t)kPORT_FastSlewRate,
                                        /* Passive input filter is disabled */
                                        (uint16_t)kPORT_PassiveFilterDisable,
                                        /* Open drain output is disabled */
                                        (uint16_t)kPORT_OpenDrainDisable,
                                        /* Low drive strength is configured */
                                        (uint16_t)kPORT_LowDriveStrength,
                                        /* Normal drive strength is configured */
                                        (uint16_t)kPORT_NormalDriveStrength,
                                        /* Pin is configured as LPSPI1_PCS0 */
                                        (uint16_t)kPORT_MuxAlt2,
                                        /* Pin Control Register fields [15:0] are not locked */
                                        (uint16_t)kPORT_UnlockRegister};
    /* PORTB0 (pin 46) is configured as LPSPI1_PCS0 */
    PORT_SetPinConfig(BOARD_INITFLASHPINS_FLASH_CS_PORT, BOARD_INITFLASHPINS_FLASH_CS_PIN, &FLASH_CS);

    const port_pin_config_t FLASH_SIN = {/* Internal pull-up/down resistor is disabled */
                                         (uint16_t)kPORT_PullDisable,
                                         /* Low internal pull resistor value is selected. */
                                         (uint16_t)kPORT_LowPullResistor,
                                         /* Fast slew rate is configured */
                                         (uint16_t)kPORT_FastSlewRate,
                                         /* Passive input filter is disabled */
                                         (uint16_t)kPORT_PassiveFilterDisable,
                                         /* Open drain output is disabled */
                                         (uint16_t)kPORT_OpenDrainDisable,
                                         /* Low drive strength is configured */
                                         (uint16_t)kPORT_LowDriveStrength,
                                         /* Normal drive strength is configured */
                                         (uint16_t)kPORT_NormalDriveStrength,
                                         /* Pin is configured as LPSPI1_SIN */
                                         (uint16_t)kPORT_MuxAlt2,
                                         /* Pin Control Register fields [15:0] are not locked */
                                         (uint16_t)kPORT_UnlockRegister};
    /* PORTB1 (pin 47) is configured as LPSPI1_SIN */
    PORT_SetPinConfig(BOARD_INITFLASHPINS_FLASH_SIN_PORT, BOARD_INITFLASHPINS_FLASH_SIN_PIN, &FLASH_SIN);

    const port_pin_config_t FLASH_SCK = {/* Internal pull-up/down resistor is disabled */
                                         (uint16_t)kPORT_PullDisable,
                                         /* Low internal pull resistor value is selected. */
                                         (uint16_t)kPORT_LowPullResistor,
                                         /* Fast slew rate is configured */
                                         (uint16_t)kPORT_FastSlewRate,
                                         /* Passive input filter is disabled */
                                         (uint16_t)kPORT_PassiveFilterDisable,
                                         /* Open drain output is disabled */
                                         (uint16_t)kPORT_OpenDrainDisable,
                                         /* Low drive strength is configured */
                                         (uint16_t)kPORT_LowDriveStrength,
                                         /* Normal drive strength is configured */
                                         (uint16_t)kPORT_NormalDriveStrength,
                                         /* Pin is configured as LPSPI1_SCK */
                                         (uint16_t)kPORT_MuxAlt2,
                                         /* Pin Control Register fields [15:0] are not locked */
                                         (uint16_t)kPORT_UnlockRegister};
    /* PORTB2 (pin 48) is configured as LPSPI1_SCK */
    PORT_SetPinConfig(BOARD_INITFLASHPINS_FLASH_SCK_PORT, BOARD_INITFLASHPINS_FLASH_SCK_PIN, &FLASH_SCK);

    const port_pin_config_t FLASH_SOUT = {/* Internal pull-up/down resistor is disabled */
                                          (uint16_t)kPORT_PullDisable,
                                          /* Low internal pull resistor value is selected. */
                                          (uint16_t)kPORT_LowPullResistor,
                                          /* Fast slew rate is configured */
                                          (uint16_t)kPORT_FastSlewRate,
                                          /* Passive input filter is disabled */
                                          (uint16_t)kPORT_PassiveFilterDisable,
                                          /* Open drain output is disabled */
                                          (uint16_t)kPORT_OpenDrainDisable,
                                          /* Low drive strength is configured */
                                          (uint16_t)kPORT_LowDriveStrength,
                                          /* Normal drive strength is configured */
                                          (uint16_t)kPORT_NormalDriveStrength,
                                          /* Pin is configured as LPSPI1_SOUT */
                                          (uint16_t)kPORT_MuxAlt2,
                                          /* Pin Control Register fields [15:0] are not locked */
                                          (uint16_t)kPORT_UnlockRegister};
    /* PORTB3 (pin 1) is configured as LPSPI1_SOUT */
    PORT_SetPinConfig(BOARD_INITFLASHPINS_FLASH_SOUT_PORT, BOARD_INITFLASHPINS_FLASH_SOUT_PIN, &FLASH_SOUT);

    const port_pin_config_t FLASH_RST = {/* Internal pull-up/down resistor is disabled */
                                         (uint16_t)kPORT_PullDisable,
                                         /* Low internal pull resistor value is selected. */
                                         (uint16_t)kPORT_LowPullResistor,
                                         /* Fast slew rate is configured */
                                         (uint16_t)kPORT_FastSlewRate,
                                         /* Passive input filter is disabled */
                                         (uint16_t)kPORT_PassiveFilterDisable,
                                         /* Open drain output is disabled */
                                         (uint16_t)kPORT_OpenDrainDisable,
                                         /* Low drive strength is configured */
                                         (uint16_t)kPORT_LowDriveStrength,
                                         /* Normal drive strength is configured */
                                         (uint16_t)kPORT_NormalDriveStrength,
                                         /* Pin is configured as PTB4 */
                                         (uint16_t)kPORT_MuxAsGpio,
                                         /* Pin Control Register fields [15:0] are not locked */
                                         (uint16_t)kPORT_UnlockRegister};
    /* PORTB4 (pin 2) is configured as PTB4 */
    PORT_SetPinConfig(BOARD_INITFLASHPINS_FLASH_RST_PORT, BOARD_INITFLASHPINS_FLASH_RST_PIN, &FLASH_RST);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitACCELPins:
- options: {callFromInitBoot: 'false', coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: '37', peripheral: LPI2C1, signal: SCL, pin_signal: PTC0/WUU0_P7/LPSPI1_PCS2/I3C0_SDA/TPM1_CH0/LPI2C1_SCL/FLEXIO0_D16, identifier: ACCEL_SCL, pull_select: up,
    pull_enable: enable, pull_value: low, slew_rate: fast, passive_filter: disable, open_drain: disable, drive_strength: low, drive_strength_1: normal}
  - {pin_num: '38', peripheral: LPI2C1, signal: SDA, pin_signal: PTC1/WUU0_P8/LPSPI1_PCS3/I3C0_SCL/TPM1_CH1/LPI2C1_SDA/FLEXIO0_D17, identifier: ACCEL_SDA, pull_select: up,
    pull_enable: enable, slew_rate: fast, passive_filter: disable, open_drain: disable, drive_strength: low, drive_strength_1: normal}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

